MODEL INFO: 
Image resolution: 100x100
Model optimizer, learning rate: Adam, 0.00100
Model loss function: mean_squared_error
Number of epochs: 100
Model structure: Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 96, 96, 32)        832       
_________________________________________________________________
activation (Activation)      (None, 96, 96, 32)        0         
_________________________________________________________________
lambda (Lambda)              (None, 96, 96, 17)        0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 48, 48, 17)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 46, 46, 64)        9856      
_________________________________________________________________
activation_1 (Activation)    (None, 46, 46, 64)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 23, 23, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 21, 21, 256)       147712    
_________________________________________________________________
activation_2 (Activation)    (None, 21, 21, 256)       0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 10, 10, 256)       0         
_________________________________________________________________
flatten (Flatten)            (None, 25600)             0         
_________________________________________________________________
dense (Dense)                (None, 16)                409616    
_________________________________________________________________
dropout (Dropout)            (None, 16)                0         
_________________________________________________________________
activation_3 (Activation)    (None, 16)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 17        
=================================================================
Total params: 568,033
Trainable params: 568,033
Non-trainable params: 0
_________________________________________________________________
Test dataset evaluation: [('loss', 16.602567143594065), ('mean_absolute_error', 3.2511096)]
