MODEL INFO: 
Image resolution: 224x224
Model optimizer, learning rate: Adam, 0.00100
Model loss function: mean_squared_error
Number of epochs: 300
Model structure: Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 224, 224, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 224, 224, 32)      832       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 224, 224, 32)      25632     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 224, 224, 32)      25632     
_________________________________________________________________
activation (Activation)      (None, 224, 224, 32)      0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 44, 44, 32)        0         
_________________________________________________________________
lambda (Lambda)              (None, 44, 44, 17)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 44, 44, 64)        9856      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 44, 44, 64)        36928     
_________________________________________________________________
activation_1 (Activation)    (None, 44, 44, 64)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 14, 14, 64)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 14, 14, 128)       73856     
_________________________________________________________________
activation_2 (Activation)    (None, 14, 14, 128)       0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 7, 7, 128)         0         
_________________________________________________________________
flatten (Flatten)            (None, 6272)              0         
_________________________________________________________________
dense (Dense)                (None, 64)                401472    
_________________________________________________________________
activation_3 (Activation)    (None, 64)                0         
_________________________________________________________________
dropout (Dropout)            (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 65        
=================================================================
Total params: 574,273
Trainable params: 574,273
Non-trainable params: 0
_________________________________________________________________
Test dataset evaluation: [('loss', 3.6358480330436462), ('mean_absolute_error', 1.4142357)]




# 21yeaao7eyemf4ipkrnp3ufdi-user
