MODEL INFO: 
Image resolution: 256x256
Model optimizer, learning rate: Adam, 0.00100
Model loss function: mean_squared_error
Number of epochs: 32
Model structure: Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 232, 232, 32)      20032     
_________________________________________________________________
activation (Activation)      (None, 232, 232, 32)      0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 33, 33, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 31, 31, 64)        18496     
_________________________________________________________________
activation_1 (Activation)    (None, 31, 31, 64)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 15, 15, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 13, 13, 256)       147712    
_________________________________________________________________
activation_2 (Activation)    (None, 13, 13, 256)       0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 6, 6, 256)         0         
_________________________________________________________________
flatten (Flatten)            (None, 9216)              0         
_________________________________________________________________
dense (Dense)                (None, 16)                147472    
_________________________________________________________________
batch_normalization (BatchNo (None, 16)                64        
_________________________________________________________________
activation_3 (Activation)    (None, 16)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 17        
=================================================================
Total params: 333,793
Trainable params: 333,761
Non-trainable params: 32
_________________________________________________________________
Test dataset evaluation: [('loss', 51.39567521618259), ('mean_absolute_error', 6.542064)]
