MODEL INFO: 
Image resolution: 150x150
Model optimizer, learning rate: Adam, 0.00100
Model loss function: mean_squared_error
Number of epochs: 100
Model structure: Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 150, 150, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 150, 150, 4)       104       
_________________________________________________________________
activation (Activation)      (None, 150, 150, 4)       0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 30, 30, 4)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 30, 30, 8)         808       
_________________________________________________________________
activation_1 (Activation)    (None, 30, 30, 8)         0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 15, 15, 8)         0         
_________________________________________________________________
flatten (Flatten)            (None, 1800)              0         
_________________________________________________________________
dense (Dense)                (None, 64)                115264    
_________________________________________________________________
activation_2 (Activation)    (None, 64)                0         
_________________________________________________________________
dropout (Dropout)            (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 65        
=================================================================
Total params: 116,241
Trainable params: 116,241
Non-trainable params: 0
_________________________________________________________________
Test dataset evaluation: [('loss', 10.451915550231934), ('mean_absolute_error', 2.540864)]
