MODEL INFO: 
Image resolution: 100x100
Model optimizer, learning rate: Adam, 0.00100
Model loss function: mean_squared_error
Number of epochs: 100
Model structure: Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 96, 96, 4)         104       
_________________________________________________________________
batch_normalization (BatchNo (None, 96, 96, 4)         16        
_________________________________________________________________
activation (Activation)      (None, 96, 96, 4)         0         
_________________________________________________________________
lambda (Lambda)              (None, 96, 96, 3)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 92, 92, 8)         608       
_________________________________________________________________
batch_normalization_1 (Batch (None, 92, 92, 8)         32        
_________________________________________________________________
activation_1 (Activation)    (None, 92, 92, 8)         0         
_________________________________________________________________
flatten (Flatten)            (None, 67712)             0         
_________________________________________________________________
dense (Dense)                (None, 64)                4333632   
_________________________________________________________________
activation_2 (Activation)    (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 65        
=================================================================
Total params: 4,334,457
Trainable params: 4,334,433
Non-trainable params: 24
_________________________________________________________________
Test dataset evaluation: [('loss', 50.47802950951361), ('mean_absolute_error', 5.755961)]
