MODEL INFO: 
Image resolution: 300x300
Model optimizer, learning rate: Adam, 0.00100
Model loss function: mean_squared_error
Number of epochs: 100
Model structure: Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 300, 300, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 300, 300, 4)       104       
_________________________________________________________________
activation (Activation)      (None, 300, 300, 4)       0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 60, 60, 4)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 60, 60, 8)         808       
_________________________________________________________________
activation_1 (Activation)    (None, 60, 60, 8)         0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 30, 30, 8)         0         
_________________________________________________________________
flatten (Flatten)            (None, 7200)              0         
_________________________________________________________________
dense (Dense)                (None, 64)                460864    
_________________________________________________________________
activation_2 (Activation)    (None, 64)                0         
_________________________________________________________________
dropout (Dropout)            (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 65        
=================================================================
Total params: 461,841
Trainable params: 461,841
Non-trainable params: 0
_________________________________________________________________
Test dataset evaluation: [('loss', 9.635865488360006), ('mean_absolute_error', 2.4624684)]
