MODEL INFO: 
Image resolution: 100x100
Model optimizer, learning rate: Adam, 0.00100
Model loss function: mean_squared_error
Number of epochs: 100
Model structure: Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 76, 76, 32)        20032     
_________________________________________________________________
activation (Activation)      (None, 76, 76, 32)        0         
_________________________________________________________________
lambda (Lambda)              (None, 76, 76, 17)        0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 10, 10, 17)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          9856      
_________________________________________________________________
activation_1 (Activation)    (None, 8, 8, 64)          0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 4, 64)          0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 2, 2, 256)         147712    
_________________________________________________________________
activation_2 (Activation)    (None, 2, 2, 256)         0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 1, 1, 256)         0         
_________________________________________________________________
flatten (Flatten)            (None, 256)               0         
_________________________________________________________________
dense (Dense)                (None, 16)                4112      
_________________________________________________________________
batch_normalization (BatchNo (None, 16)                64        
_________________________________________________________________
activation_3 (Activation)    (None, 16)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 17        
=================================================================
Total params: 181,793
Trainable params: 181,761
Non-trainable params: 32
_________________________________________________________________
Test dataset evaluation: [('loss', 28.205185108800087), ('mean_absolute_error', 4.0909586)]
