MODEL INFO: 
Image resolution: 150x150
Model optimizer, learning rate: Adam, 0.00100
Model loss function: mean_squared_error
Number of epochs: 100
Model structure: Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 150, 150, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 150, 150, 4)       104       
_________________________________________________________________
batch_normalization (BatchNo (None, 150, 150, 4)       16        
_________________________________________________________________
activation (Activation)      (None, 150, 150, 4)       0         
_________________________________________________________________
average_pooling2d (AveragePo (None, 30, 30, 4)         0         
_________________________________________________________________
lambda (Lambda)              (None, 30, 30, 3)         0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 30, 30, 3)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 30, 30, 8)         608       
_________________________________________________________________
batch_normalization_1 (Batch (None, 30, 30, 8)         32        
_________________________________________________________________
activation_1 (Activation)    (None, 30, 30, 8)         0         
_________________________________________________________________
flatten (Flatten)            (None, 7200)              0         
_________________________________________________________________
dense (Dense)                (None, 64)                460864    
_________________________________________________________________
activation_2 (Activation)    (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 65        
=================================================================
Total params: 461,689
Trainable params: 461,665
Non-trainable params: 24
_________________________________________________________________
Test dataset evaluation: [('loss', 17.8365174201227), ('mean_absolute_error', 3.4026337)]
